# Test Plan

The goal of this test plan is to demonstrate that the `boot_order` property of the `network_interface` block in the `harvester_virtualmachine` Terraform resource can be used to facilitate network booting for VMs.

## Setup

### 1. Set up single-node Harvester in ipxe-examples environment

It's not mandatory to use the ipxe-examples environment, but it's convenient, because it already includes everything needed for a PXE boot environment for VMs

### 2. Prepare PXE boot environment for VMs

1) Set up VM network

<img width="1740" height="829" alt="Image" src="https://github.com/user-attachments/assets/8e903d84-dab8-4606-bc34-0ad39c3c9fb7" />

2) Download Live System Image

I'll use GRML in this example, because it's small, it's made to be used as live-system and there are instructions online how to set it up with PXE

```
root@pxe-server:/tmp# wget https://download.grml.org/grml-small-2025.05-amd64.iso
root@pxe-server:/tmp# mount -o loop grml-small-2025.05-amd64.iso /mnt/
```

3) Copy files

```
root@pxe-server:/# mkdir -p /var/www/grml
root@pxe-server:/# cd /var/www/grml
root@pxe-server:/var/www/grml# cp /mnt/boot/grmlsmallamd64/* .
root@pxe-server:/var/www/grml# cp /mnt/live/grml-small-amd64/grml-small-amd64.squashfs .
```

4) Create iPXE boot script

```
root@pxe-server:/var/www/grml# cd /var/www/harvester
root@pxe-server:/var/www/harvester# cat <<EOF>02\:00\:00\:03\:3e\:ff
#!ipxe

initrd http://192.168.0.254/grml/initrd.img
chain http://192.168.0.254/grml/vmlinuz boot=live fetch=http://192.168.0.254/grml/grml-small-amd64.squashfs apm=power-off nomce noprompt noeject grml2ram
EOF
```

### 3. Prepare Terraform Resources

Note: The disk isn't strictly mandatory, but the Terraform provider requires that a `harvester_virtualmachine` resource has a `disk` block. This needs fixing in the future.

Make sure to match the MAC address of the network interface with the filename from the earlier step. The network interface also must be of type "bridge"

```
resource "harvester_virtualmachine" "netboot" {
  name                 = "netboot"
  namespace            = "default"
  restart_after_update = true

  description = "test netbooting"

  cpu    = 2
  memory = "2Gi"

  run_strategy    = "RerunOnFailure"
  hostname        = "netboot"
  reserved_memory = "100Mi"
  machine_type    = "q35"

  network_interface {
    name           = "nic-1"
    mac_address    = "02:00:00:03:3e:ff"
    network_name   = "vm-network"
    type           = "bridge"
    wait_for_lease = true
    boot_order     = 1
  }

  disk {
    name        = "emptydisk"
    type        = "disk"
    size        = "20Gi"
    bus         = "virtio"
    auto_delete = true
    boot_order  = 2
  }
}

```

### 4. Terraform Apply

```
│ ~/repos/harvester/terraform-provider-harvester │► terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # harvester_virtualmachine.netboot will be created
  + resource "harvester_virtualmachine" "netboot" {
      + cpu                     = 2
      + cpu_pinning             = false
      + description             = "test netbooting"
      + efi                     = false
      + hostname                = "netboot"
      + id                      = (known after apply)
      + isolate_emulator_thread = false
      + machine_type            = "q35"
      + memory                  = "2Gi"
      + message                 = (known after apply)
      + name                    = "netboot"
      + namespace               = "default"
      + node_name               = (known after apply)
      + reserved_memory         = "100Mi"
      + restart_after_update    = true
      + run_strategy            = "RerunOnFailure"
      + secure_boot             = false
      + state                   = (known after apply)

      + disk {
          + access_mode        = (known after apply)
          + auto_delete        = true
          + boot_order         = 2
          + bus                = "virtio"
          + hot_plug           = (known after apply)
          + name               = "emptydisk"
          + size               = "20Gi"
          + storage_class_name = (known after apply)
          + type               = "disk"
          + volume_mode        = (known after apply)
          + volume_name        = (known after apply)
        }

      + network_interface {
          + boot_order     = 1
          + interface_name = (known after apply)
          + ip_address     = (known after apply)
          + mac_address    = "02:00:00:03:3e:ff"
          + model          = "virtio"
          + name           = "nic-1"
          + network_name   = "vm-network"
          + type           = "bridge"
          + wait_for_lease = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

harvester_virtualmachine.netboot: Creating...
harvester_virtualmachine.netboot: Still creating... [10s elapsed]
harvester_virtualmachine.netboot: Still creating... [20s elapsed]
harvester_virtualmachine.netboot: Still creating... [30s elapsed]
harvester_virtualmachine.netboot: Creation complete after 39s [id=default/netboot]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

<img width="3829" height="2057" alt="Image" src="https://github.com/user-attachments/assets/f27a33e9-6764-4578-b1d0-5166511c9048" />

<img width="1537" height="1175" alt="Image" src="https://github.com/user-attachments/assets/642ccede-1a09-4ec1-8e9f-9b67ca2440dd" />